#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mgoogle_storage_bucket.data-lake-bucket: Refreshing state... [id=dtc-dev-test123-demo-bucket][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [31m-[0m destroy
[0m
Terraform will perform the following actions:

[1m  # google_storage_bucket.data-lake-bucket[0m will be [1m[31mdestroyed[0m
  # (because google_storage_bucket.data-lake-bucket is not in configuration)[0m
[0m  [31m-[0m[0m resource "google_storage_bucket" "data-lake-bucket" {
      [31m-[0m [0m[1m[0mdefault_event_based_hold[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mforce_destroy[0m[0m               = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                          = "dtc-dev-test123-demo-bucket" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                      = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlocation[0m[0m                    = "US-WEST1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                        = "dtc-dev-test123-demo-bucket" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                     = "dtc-dataops-dev-366316" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mrequester_pays[0m[0m              = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                   = "https://www.googleapis.com/storage/v1/b/dtc-dev-test123-demo-bucket" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0muniform_bucket_level_access[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0murl[0m[0m                         = "gs://dtc-dev-test123-demo-bucket" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.lifecycle_bucket.google_storage_bucket.gcp_bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "gcp_bucket" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = true
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "US-WEST1"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "dtc-nyc-taxi-dev-dtc-dataops-dev-366316"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = true
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)

      [32m+[0m [0mlifecycle_rule {
          [32m+[0m [0maction {
              [32m+[0m [0m[1m[0mtype[0m[0m = "Delete"
            }

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mage[0m[0m                   = 30
              [32m+[0m [0m[1m[0mmatches_prefix[0m[0m        = []
              [32m+[0m [0m[1m[0mmatches_storage_class[0m[0m = []
              [32m+[0m [0m[1m[0mmatches_suffix[0m[0m        = []
              [32m+[0m [0m[1m[0mwith_state[0m[0m            = (known after apply)
            }
        }

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m = true
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*